# powerscale_filesystem.file_system_test["/ifs/zone/cluster/data005"] will be created
  + resource "powerscale_filesystem" "file_system_test" {
      + authoritative  = (known after apply)
      + creation_time  = (known after apply)
      + directory_path = "/ifs/zone/cluster/data005"
      + full_path      = (known after apply)
      + group          = {
          + id   = "GID:0"
          + name = "wheel"
          + type = "group"
        }
      + id             = (known after apply)
      + mode           = (known after apply)
      + name           = ""
      + overwrite      = false
      + owner          = {
          + id   = "UID:1501"
          + name = "Guest"
          + type = "user"
        }
      + recursive      = true
      + type           = (known after apply)
    }

  # powerscale_filesystem.file_system_test["/ifs/zone/cluster/data006"] will be created
  + resource "powerscale_filesystem" "file_system_test" {
      + authoritative  = (known after apply)
      + creation_time  = (known after apply)
      + directory_path = "/ifs/zone/cluster/data006"
      + full_path      = (known after apply)
      + group          = {
          + id   = "GID:0"
          + name = "wheel"
          + type = "group"
        }
      + id             = (known after apply)
      + mode           = (known after apply)
      + name           = ""
      + overwrite      = false
      + owner          = {
          + id   = "UID:1501"
          + name = "Guest"
          + type = "user"
        }
      + recursive      = true
      + type           = (known after apply)
    }

  # powerscale_nfs_export.nfsTestExport["/ifs/zone/cluster/data004"] will be created
  + resource "powerscale_nfs_export" "nfsTestExport" {
      + all_dirs                = (known after apply)
      + block_size              = (known after apply)
      + can_set_time            = (known after apply)
      + case_insensitive        = (known after apply)
      + case_preserving         = (known after apply)
      + chown_restricted        = (known after apply)
      + clients                 = [
          + "10.15.87.76",
          + "10.15.87.82",
          + "10.15.87.53",
        ]
      + commit_asynchronous     = (known after apply)
      + conflicting_paths       = (known after apply)
      + description             = "REQ1234567/RITS1234578_Powerscale_3G_PD"
      + directory_transfer_size = (known after apply)
      + encoding                = (known after apply)
      + id                      = (known after apply)
      + link_max                = (known after apply)
      + map_failure             = (known after apply)
      + map_full                = (known after apply)
      + map_lookup_uid          = (known after apply)
      + map_non_root            = (known after apply)
      + map_retry               = (known after apply)
      + map_root                = (known after apply)
      + max_file_size           = (known after apply)
      + name_max_size           = (known after apply)
      + no_truncate             = (known after apply)
      + paths                   = [
          + "/ifs/zone/cluster/data004",
        ]
      + read_only               = (known after apply)
      + read_only_clients       = (known after apply)
      + read_transfer_max_size  = (known after apply)
      + read_transfer_multiple  = (known after apply)
      + read_transfer_size      = (known after apply)
      + read_write_clients      = (known after apply)
      + readdirplus             = (known after apply)
      + readdirplus_prefetch    = (known after apply)
      + return_32bit_file_ids   = (known after apply)
      + root_clients            = [
          + "10.15.87.76",
          + "10.15.87.82",
          + "10.15.87.53",
        ]
      + security_flavors        = (known after apply)
      + setattr_asynchronous    = (known after apply)
      + snapshot                = (known after apply)
      + symlinks                = (known after apply)
      + time_delta              = (known after apply)
      + unresolved_clients      = (known after apply)
      + write_datasync_action   = (known after apply)
      + write_datasync_reply    = (known after apply)
      + write_filesync_action   = (known after apply)
      + write_filesync_reply    = (known after apply)
      + write_transfer_max_size = (known after apply)
      + write_transfer_multiple = (known after apply)
      + write_transfer_size     = (known after apply)
      + write_unstable_action   = (known after apply)
      + write_unstable_reply    = (known after apply)
      + zone                    = "ZONE"
    }

  # powerscale_nfs_export.nfsTestExport["/ifs/zone/cluster/data005"] will be created
  + resource "powerscale_nfs_export" "nfsTestExport" {
      + all_dirs                = (known after apply)
      + block_size              = (known after apply)
      + can_set_time            = (known after apply)
      + case_insensitive        = (known after apply)
      + case_preserving         = (known after apply)
      + chown_restricted        = (known after apply)
      + clients                 = [
          + "10.15.87.76",
          + "10.15.87.82",
          + "10.15.87.53",
        ]
      + commit_asynchronous     = (known after apply)
      + conflicting_paths       = (known after apply)
      + description             = "REQ1234567/RITS1234578_Powerscale_3G_PD"
      + directory_transfer_size = (known after apply)
      + encoding                = (known after apply)
      + id                      = (known after apply)
      + link_max                = (known after apply)
      + map_failure             = (known after apply)
      + map_full                = (known after apply)
      + map_lookup_uid          = (known after apply)
      + map_non_root            = (known after apply)
      + map_retry               = (known after apply)
      + map_root                = (known after apply)
      + max_file_size           = (known after apply)
      + name_max_size           = (known after apply)
      + no_truncate             = (known after apply)
      + paths                   = [
          + "/ifs/zone/cluster/data005",
        ]
      + read_only               = (known after apply)
      + read_only_clients       = (known after apply)
      + read_transfer_max_size  = (known after apply)
      + read_transfer_multiple  = (known after apply)
      + read_transfer_size      = (known after apply)
      + read_write_clients      = (known after apply)
      + readdirplus             = (known after apply)
      + readdirplus_prefetch    = (known after apply)
      + return_32bit_file_ids   = (known after apply)
      + root_clients            = [
          + "10.15.87.76",
          + "10.15.87.82",
          + "10.15.87.53",
        ]
      + security_flavors        = (known after apply)
      + setattr_asynchronous    = (known after apply)
      + snapshot                = (known after apply)
      + symlinks                = (known after apply)
      + time_delta              = (known after apply)
      + unresolved_clients      = (known after apply)
      + write_datasync_action   = (known after apply)
      + write_datasync_reply    = (known after apply)
      + write_filesync_action   = (known after apply)
      + write_filesync_reply    = (known after apply)
      + write_transfer_max_size = (known after apply)
      + write_transfer_multiple = (known after apply)
      + write_transfer_size     = (known after apply)
      + write_unstable_action   = (known after apply)
      + write_unstable_reply    = (known after apply)
      + zone                    = "ZONE"
    }

  # powerscale_nfs_export.nfsTestExport["/ifs/zone/cluster/data006"] will be created
  + resource "powerscale_nfs_export" "nfsTestExport" {
      + all_dirs                = (known after apply)
      + block_size              = (known after apply)
      + can_set_time            = (known after apply)
      + case_insensitive        = (known after apply)
      + case_preserving         = (known after apply)
      + chown_restricted        = (known after apply)
      + clients                 = [
          + "10.15.87.76",
          + "10.15.87.82",
          + "10.15.87.53",
        ]
      + commit_asynchronous     = (known after apply)
      + conflicting_paths       = (known after apply)
      + description             = "REQ1234567/RITS1234578_Powerscale_3G_PD"
      + directory_transfer_size = (known after apply)
      + encoding                = (known after apply)
      + id                      = (known after apply)
      + link_max                = (known after apply)
      + map_failure             = (known after apply)
      + map_full                = (known after apply)
      + map_lookup_uid          = (known after apply)
      + map_non_root            = (known after apply)
      + map_retry               = (known after apply)
      + map_root                = (known after apply)
      + max_file_size           = (known after apply)
      + name_max_size           = (known after apply)
      + no_truncate             = (known after apply)
      + paths                   = [
          + "/ifs/zone/cluster/data006",
        ]
      + read_only               = (known after apply)
      + read_only_clients       = (known after apply)
      + read_transfer_max_size  = (known after apply)
      + read_transfer_multiple  = (known after apply)
      + read_transfer_size      = (known after apply)
      + read_write_clients      = (known after apply)
      + readdirplus             = (known after apply)
      + readdirplus_prefetch    = (known after apply)
      + return_32bit_file_ids   = (known after apply)
      + root_clients            = [
          + "10.15.87.76",
          + "10.15.87.82",
          + "10.15.87.53",
        ]
      + security_flavors        = (known after apply)
      + setattr_asynchronous    = (known after apply)
      + snapshot                = (known after apply)
      + symlinks                = (known after apply)
      + time_delta              = (known after apply)
      + unresolved_clients      = (known after apply)
      + write_datasync_action   = (known after apply)
      + write_datasync_reply    = (known after apply)
      + write_filesync_action   = (known after apply)
      + write_filesync_reply    = (known after apply)
      + write_transfer_max_size = (known after apply)
      + write_transfer_multiple = (known after apply)
      + write_transfer_size     = (known after apply)
      + write_unstable_action   = (known after apply)
      + write_unstable_reply    = (known after apply)
      + zone                    = "ZONE"
    }

  # powerscale_quota.nfsQuotaTest["/ifs/zone/cluster/data004"] will be created
  + resource "powerscale_quota" "nfsQuotaTest" {
      + container         = (known after apply)
      + efficiency_ratio  = (known after apply)
      + enforced          = (known after apply)
      + id                = (known after apply)
      + include_snapshots = false
      + linked            = (known after apply)
      + notifications     = (known after apply)
      + path              = "/ifs/zone/cluster/data004"
      + ready             = (known after apply)
      + reduction_ratio   = (known after apply)
      + thresholds        = {
          + advisory               = (known after apply)
          + advisory_exceeded      = (known after apply)
          + advisory_last_exceeded = (known after apply)
          + hard                   = 100
          + hard_exceeded          = (known after apply)
          + hard_last_exceeded     = (known after apply)
          + percent_advisory       = 80
          + soft                   = (known after apply)
          + soft_exceeded          = (known after apply)
          + soft_grace             = (known after apply)
          + soft_last_exceeded     = (known after apply)
        }
      + thresholds_on     = "applogicalsize"
      + type              = "directory"
      + usage             = (known after apply)
    }

  # powerscale_quota.nfsQuotaTest["/ifs/zone/cluster/data005"] will be created
  + resource "powerscale_quota" "nfsQuotaTest" {
      + container         = (known after apply)
      + efficiency_ratio  = (known after apply)
      + enforced          = (known after apply)
      + id                = (known after apply)
      + include_snapshots = false
      + linked            = (known after apply)
      + notifications     = (known after apply)
      + path              = "/ifs/zone/cluster/data005"
      + ready             = (known after apply)
      + reduction_ratio   = (known after apply)
      + thresholds        = {
          + advisory               = (known after apply)
          + advisory_exceeded      = (known after apply)
          + advisory_last_exceeded = (known after apply)
          + hard                   = 100
          + hard_exceeded          = (known after apply)
          + hard_last_exceeded     = (known after apply)
          + percent_advisory       = 80
          + soft                   = (known after apply)
          + soft_exceeded          = (known after apply)
          + soft_grace             = (known after apply)
          + soft_last_exceeded     = (known after apply)
        }
      + thresholds_on     = "applogicalsize"
      + type              = "directory"
      + usage             = (known after apply)
    }

  # powerscale_quota.nfsQuotaTest["/ifs/zone/cluster/data006"] will be created
  + resource "powerscale_quota" "nfsQuotaTest" {
      + container         = (known after apply)
      + efficiency_ratio  = (known after apply)
      + enforced          = (known after apply)
      + id                = (known after apply)
      + include_snapshots = false
      + linked            = (known after apply)
      + notifications     = (known after apply)
      + path              = "/ifs/zone/cluster/data006"
      + ready             = (known after apply)
      + reduction_ratio   = (known after apply)
      + thresholds        = {
          + advisory               = (known after apply)
          + advisory_exceeded      = (known after apply)
          + advisory_last_exceeded = (known after apply)
          + hard                   = 100
          + hard_exceeded          = (known after apply)
          + hard_last_exceeded     = (known after apply)
          + percent_advisory       = 80
          + soft                   = (known after apply)
          + soft_exceeded          = (known after apply)
          + soft_grace             = (known after apply)
          + soft_last_exceeded     = (known after apply)
        }
      + thresholds_on     = "applogicalsize"
      + type              = "directory"
      + usage             = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.